:PROPERTIES:
:ID: 7955CC98-C463-48C9-B8AE-6B5F95CE2306
:END:
#+title: List All Currencies
#+description: List All Currencies
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:currencies:
#+created: 2026-05-21
#+updated: 2026-05-21

#+begin_src sql
select iso_code, name, symbol, numeric_code, asset_class, market_tier
from ores.currencies
where valid_to = '9999-12-31 23:59:59'::timestamptz
order by iso_code
limit 10;
#+end_src

#+RESULTS:
#+begin_example
| iso_code | name                          | symbol | numeric_code | asset_class | market_tier |
|----------+-------------------------------+--------+--------------+-------------+-------------|
| AED      | UAE Dirham                    | د.إ    |          784 | fiat        | emerging    |
| AFN      | Afghan Afghani                | ؋      |          971 | fiat        | frontier    |
| ALL      | Albanian Lek                  | L      |          008 | fiat        | frontier    |
| AMD      | Armenian Dram                 | ֏     |          051 | fiat        | frontier    |
| ANG      | Netherlands Antillean Guilder | ƒ      |          532 | fiat        | exotic      |
| AOA      | Angolan Kwanza                | Kz     |          973 | fiat        | frontier    |
| ARS      | Argentine Peso                | $      |          032 | fiat        | emerging    |
| AUD      | Australian Dollar             | A$     |          036 | fiat        | g10         |
| AWG      | Aruban Florin                 | ƒ      |          533 | fiat        | exotic      |
| AZN      | Azerbaijani Manat             | ₼     |          944 | fiat        | frontier    |
#+end_example
